In [23]:
import pandas as pd

In [24]:
df = pd.read_csv("data_tree.csv", delimiter=';')

In [25]:
df.head()

  company                  job     degree  salary_more_than_100k
0  google     sales executives  bachelors                      0
1  google     sales executives    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [26]:
inputs = df.drop('salary_more_than_100k', axis='columns')

In [27]:
inputs.head()

  company                  job     degree
0  google     sales executives  bachelors
1  google     sales executives    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [28]:
print('hello')

hello

In [29]:
target = df.salary_more_than_100k

In [30]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_than_100k, dtype: int64

In [31]:
##lets use label encoder for the nuberling the label
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [56]:
inputs['company_n'] = encoder.fit_transform(inputs.company)
le_name_mapping = dict(zip(encoder.classes_, encoder.transform(encoder.classes_)))
inputs['job_n'] = encoder.fit_transform(inputs.job)
le_name_mapping = dict(zip(encoder.classes_, encoder.transform(encoder.classes_)))
inputs['degree_n'] = encoder.fit_transform(inputs.degree)
le_name_mapping = dict(zip(encoder.classes_, encoder.transform(encoder.classes_)))

In [66]:
# lets check which values has got what number
col = ['company','job','degree']
le_name = {}
def mapingenc():
    for i in col:
        inputs[i+'_n'] = encoder.fit_transform(inputs[i])
        le_name.update(zip(encoder.classes_,encoder.transform(encoder.classes_)))
    return le_name

In [73]:
le_name['masters']

1

In [68]:
mapingenc()

{'abc pharma': 0,
 'facebook': 1,
 'google': 2,
 'business manager': 0,
 'computer programmer': 1,
 'sales executives': 2,
 'bachelors': 0,
 'masters': 1}

In [64]:
inputs

       company                  job     degree  company_n  job_n  degree_n
0       google     sales executives  bachelors          2      2         0
1       google     sales executives    masters          2      2         1
2       google     business manager  bachelors          2      0         0
3       google     business manager    masters          2      0         1
4       google  computer programmer  bachelors          2      1         0
5       google  computer programmer    masters          2      1         1
6   abc pharma     sales executives    masters          0      2         1
7   abc pharma  computer programmer  bachelors          0      1         0
8   abc pharma     business manager  bachelors          0      0         0
9   abc pharma     business manager    masters          0      0         1
10    facebook     sales executives  bachelors          1      2         0
11    facebook     business manager  bachelors          1      0         0
12    facebook     sales executives    masters          1      2         1
13    facebook     business manager    masters          1      0         1
14    facebook  computer programmer  bachelors          1      1         0
15    facebook  computer programmer    masters          1      1         1

In [37]:
dfnew = inputs.drop(['company','job','degree'], axis = 'columns')
dfnew

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      0         0
12          1      2         1
13          1      0         1
14          1      1         0
15          1      1         1

In [39]:
# lets import decision tree for taking decision
# decision tree is in tree libraries of sklearn so it goes like this
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [43]:
# the decision tree requires two varriable one number value and other the target
model.fit(dfnew,target)

DecisionTreeClassifier()

In [44]:
# two check the score of model
model.score(dfnew,target)

1.0

In [75]:
model.predict([[2,1,1]])

array([1])

In [57]:
le_name_mapping

{'bachelors': 0, 'masters': 1}

In [76]:
model.predict([[le_name['abc pharma'],le_name['masters'],le_name['computer programmer']]])

array([1])

In [81]:
le_name

{'abc pharma': 0,
 'facebook': 1,
 'google': 2,
 'business manager': 0,
 'computer programmer': 1,
 'sales executives': 2,
 'bachelors': 0,
 'masters': 1}